/**
 * მეილი უნდა შეიცავდეს @ და . სიმბოლოებს
 * მეილი არ უნდა იწყებოდეს @ სიმბოლოთი (უნდა იწყებოდეს ასოებით რომელსაც მოსდევს @ სიმბოლო)
 * წერტილის შემდეგ უნდა ეწეროს მინიმუმ ორი ასო მაინც (.ge, .com, .aa)
 * @param {*} value 
 */
export const validateEmail = (value) => value.match(/^([\w.%+-]+)@([\w-]+\.)+([\w]{2,})$/i);

/**
 * სახელი უნდა შეიცავდეს მხოლოდ ასოებს
 * სახელი არ უნდა შეიცავდეს სპეციალურ სიმბოლოებს(@.,/%$?) და ციფრებს
 * @param {*} value 
 */
export const validateName = (value) => value.trim().length > 2 && !value.match(/([(@!#\$%\^\&*\)\(+=._-])|([0-9])/);

/**
 * ტელეფონის ნომერი უნდა შეიცავდეს მხოლოდ ციფრებს
 * ტელეფონის ნომრის მინიმალური სიგრძეა 6
 * @param {*} value 
 */
export const validatePhone = (value) => value.match(/^[0-9]+$/) && value.trim().length > 5;

/**
 * სტრინგი უნდა შეიცავდეს მინიმუმ 1 სიმბოლოს მაინც
 * @param {*} value 
 */
export const isNotEmpty = (value) => value.trim().length > 0;

export const validationMesages = {
    required: 'ამ ველის შევსება აუცილებელია',
    name: 'სახელი უნდა შეიცავდეს მხოლოდ ასოებს, მინიმალური სავალდებულო სიგრძე: 3 სიმბოლო',
    email: 'გთხოვთ შემოიყვანეთ ვალიდური მეილი (მაგ: john.doe@gmail.com',
    phone: 'გთხოვთ შემოიყვანეთ ვალიდური ტელეფონის ნომერი, მინიმალური სავალდებულო სიგრძე: 6 სიმბოლო'
}
